<?php

$_POST += ['id'=>'', '登録時間'=>'', '位置'=>'', '本文'=>''];

検査($_POST['id'], "自然数");
検査($_POST['登録時間'], "自然数");
検査($_POST['位置'], "0以上");
検査($_POST['本文'], "必須");
検査($_POST['本文'], "64文字以下");

if(検査::失敗なら()){
    exit;
}


$db = sprintf("%s/upload/%s/%s.db", 設定['公開ディレクトリ'], date('Y/md', $_POST['登録時間']), $_POST['id']);
if(!is_file($db)){
    exit;
}


データベース("動画") -> 更新($_POST['id'], [
    "コメント数" => ["式"=>"コメント数+1"],
]);

データベース("コメント", "sqlite:$db") -> 追加([
    "本文"     => $_POST['本文'],
    "位置"     => (int)$_POST['位置'],
    "登録時間" => (int)$_SERVER['REQUEST_TIME'],
]);
